Following code is used to connect our Jupyter Notebook to our database file called *factbook.db*

In [1]:
%%capture
%load_ext sql
%sql sqlite:///factbook.db

'Connected: None@factbook.db'

For information on the tables in the database, we have to format a query as follows( thanks DQ! ). For this project, we will use the table called *facts*

In [2]:
%%sql
SELECT * FROM sqlite_master WHERE type='table';

Done.

[('table', 'sqlite_sequence', 'sqlite_sequence', 3, 'CREATE TABLE sqlite_sequence(name,seq)'),
 ('table', 'facts', 'facts', 47, 'CREATE TABLE "facts" ("id" INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL, "code" varchar(255) NOT NULL, "name" varchar(255) NOT NULL, "area" integer, "a ... (4 characters truncated) ... land" integer, "area_water" integer, "population" integer, "population_growth" float, "birth_rate" float, "death_rate" float, "migration_rate" float)')]

Query to return the first 5 rows of the facts table in the database, in order to get familiar with the data.

In [4]:
%%sql
SELECT * FROM facts LIMIT 5

Done.

[(1, 'af', 'Afghanistan', 652230, 652230, 0, 32564342, 2.32, 38.57, 13.89, 1.51),
 (2, 'al', 'Albania', 28748, 27398, 1350, 3029278, 0.3, 12.92, 6.58, 3.3),
 (3, 'ag', 'Algeria', 2381741, 2381741, 0, 39542166, 1.84, 23.67, 4.31, 0.92),
 (4, 'an', 'Andorra', 468, 468, 0, 85580, 0.12, 8.13, 6.96, 0.0),
 (5, 'ao', 'Angola', 1246700, 1246700, 0, 19625353, 2.78, 38.78, 11.49, 0.46)]

Let's use some aggregate functions on the data to find some interesting characteristics like which country has the 
- least population
- most population
- least population growth
- most populatio growth

Thankfully columns by those names are readily available, so we do not need to generate any new "virtual" columns. We can simply apply the MIN and MAX functions to the said columns. These functions are applied in the SELECT part of the query.

In [5]:
%%sql
SELECT MIN(population), MAX(population), MIN(population_growth), MAX(population_growth) FROM facts

Done.

[(0, 7256490011, 0.0, 4.02)]

Let's use subqueries, now that we already have some available to
- Return a country that has the least population
- Return a country that has the most population

Since *World* came up as a country with MAX population and *World* is not really a country, I am going to discount that name in my queries.

For the result, we will display ALL columns for information that might stand out ( and not just the *name* of the country ). Hence the SELECT *

In [16]:
%%sql
SELECT * FROM facts WHERE population = (SELECT MIN(population) from facts)

Done.

[(250, 'ay', 'Antarctica', None, 280000, None, 0, None, None, None, None)]

In [47]:
%%sql
SELECT * FROM facts WHERE population = (SELECT MAX(population) from facts WHERE name != "World")

Done.

[(37, 'ch', 'China', 9596960, 9326410, 270550, 1367485388, 0.45, 12.49, 7.53, 0.44)]

Let's calculate some averages. AVG, like MIN & MAX is also an aggregate function that we can apply to columns in the SELECT part of the query (  talking to myself about concepts I just learned from DQ ). Again, I am ignoring country name *World*

In [46]:
%%sql
SELECT  AVG(population), AVG(area) FROM facts WHERE name != "World"

Done.

[(32242666.56846473, 555093.546184739)]

Query to find all the countries that meet a certain set of conditions
- Their population is above the average
- Their area is below the average 

Again, let's not count country *name* "World". The query result will display the entire row i.e using SELECT *

In [51]:
%%sql
SELECT * FROM facts WHERE 
population > (SELECT AVG(population) FROM facts WHERE name != "World") AND 
area < (SELECT AVG(area) FROM facts)

Done.

[(14, 'bg', 'Bangladesh', 148460, 130170, 18290, 168957745, 1.6, 21.14, 5.61, 0.46),
 (65, 'gm', 'Germany', 357022, 348672, 8350, 80854408, 0.17, 8.47, 11.42, 1.24),
 (80, 'iz', 'Iraq', 438317, 437367, 950, 37056169, 2.93, 31.45, 3.77, 1.62),
 (83, 'it', 'Italy', 301340, 294140, 7200, 61855120, 0.27, 8.74, 10.19, 4.1),
 (85, 'ja', 'Japan', 377915, 364485, 13430, 126919659, 0.16, 7.93, 9.51, 0.0),
 (91, 'ks', 'Korea, South', 99720, 96920, 2800, 49115196, 0.14, 8.19, 6.75, 0.0),
 (120, 'mo', 'Morocco', 446550, 446300, 250, 33322699, 1.0, 18.2, 4.81, 3.36),
 (138, 'rp', 'Philippines', 300000, 298170, 1830, 100998376, 1.61, 24.27, 6.11, 2.09),
 (139, 'pl', 'Poland', 312685, 304255, 8430, 38562189, 0.09, 9.74, 10.19, 0.46),
 (163, 'sp', 'Spain', 505370, 498980, 6390, 48146134, 0.89, 9.64, 9.04, 8.31),
 (173, 'th', 'Thailand', 513120, 510890, 2230, 67976405, 0.34, 11.19, 7.8, 0.0),
 (182, 'ug', 'Uganda', 241038, 197100, 43938, 37101745, 3.24, 43.79, 10.69, 0.74),
 (185, 'uk', 'United Kingdom', 243610, 241930, 1680, 64088222, 0.54, 12.17, 9.35, 2.54),
 (192, 'vm', 'Vietnam', 331210, 310070, 21140, 94348835, 0.97, 15.96, 5.93, 0.3)]

Let us answer the question **Which countries have the highest ratios of water to land? Which countries have more water than land?**

First, let's see what the total number of countries in the table is, as we may or may not want to display all of them.

For this, let's display the ratio of water to land as well as columns *name*(of the country), *area_water* and *area_land*. 

Of the total number of countries, we will have the query return only the top 25 by ordering from highest to lowest ratio, rounded to two decimal places.

In [26]:
%%sql
SELECT COUNT(name) FROM facts;

Done.

[(261,)]

In [54]:
%%sql
SELECT name, area_water, area_land, ROUND(CAST(area_water as float)/CAST(area_land as Float), 2) water_land_ratio FROM facts ORDER BY water_land_ratio DESC LIMIT 25

Done.

[('British Indian Ocean Territory', 54340, 60, 905.67),
 ('Virgin Islands', 1564, 346, 4.52),
 ('Puerto Rico', 4921, 8870, 0.55),
 ('Bahamas, The', 3870, 10010, 0.39),
 ('Guinea-Bissau', 8005, 28120, 0.28),
 ('Malawi', 24404, 94080, 0.26),
 ('Netherlands', 7650, 33893, 0.23),
 ('Uganda', 43938, 197100, 0.22),
 ('Eritrea', 16600, 101000, 0.16),
 ('Liberia', 15049, 96320, 0.16),
 ('Bangladesh', 18290, 130170, 0.14),
 ('Gambia, The', 1180, 10120, 0.12),
 ('Taiwan', 3720, 32260, 0.12),
 ('Finland', 34330, 303815, 0.11),
 ('India', 314070, 2973193, 0.11),
 ('Canada', 891163, 9093507, 0.1),
 ('Colombia', 100210, 1038700, 0.1),
 ('Sweden', 39960, 410335, 0.1),
 ('Brunei', 500, 5265, 0.09),
 ('Guyana', 18120, 196849, 0.09),
 ('Nicaragua', 10380, 119990, 0.09),
 ('French Polynesia', 340, 3827, 0.09),
 ('Burundi', 2150, 25680, 0.08),
 ('Iran', 116600, 1531595, 0.08),
 ('Estonia', 2840, 42388, 0.07)]

Only two countries have more water than land. 

Next, we will try to answer the question **Which countries will add the most people to their population next year?**

For the number of people that will be added to each country, I would use the percentage population growth based on the current population that's available to us. Since we need to find out which countries will add most people, we can look for what the top 25 may be, where *name* of the country is not equal to "World". We will also round the resulting value to 2 decimal places.

In [59]:
%%sql
SELECT name, birth_rate, death_rate, population_growth, ROUND((population_growth/100)*population, 2) people_added FROM facts WHERE name != "World" ORDER BY people_added DESC LIMIT 25

Done.

[('India', 19.55, 7.32, 1.22, 15270686.12),
 ('China', 12.49, 7.53, 0.45, 6153684.25),
 ('Nigeria', 37.64, 12.9, 2.45, 4448270.37),
 ('Pakistan', 22.58, 6.49, 1.46, 2906653.37),
 ('Ethiopia', 37.27, 8.19, 2.89, 2874562.17),
 ('Bangladesh', 21.14, 5.61, 1.6, 2703323.92),
 ('United States', 12.49, 8.15, 0.78, 2506677.14),
 ('Indonesia', 16.72, 6.37, 0.92, 2355141.8),
 ('Congo, Democratic Republic of the', 34.88, 10.07, 2.45, 1944690.83),
 ('Philippines', 24.27, 6.11, 1.61, 1626073.85),
 ('Egypt', 22.9, 4.77, 1.79, 1583924.39),
 ('Brazil', 14.46, 6.58, 0.77, 1572800.55),
 ('Mexico', 18.78, 5.26, 1.18, 1436494.35),
 ('Tanzania', 36.39, 8.0, 2.79, 1424180.11),
 ('European Union', 10.2, 10.2, 0.25, 1284873.61),
 ('Uganda', 43.79, 10.69, 3.24, 1202096.54),
 ('Iraq', 31.45, 3.77, 2.93, 1085745.75),
 ('Turkey', 16.33, 5.88, 1.26, 1000619.79),
 ('Iran', 17.99, 5.94, 1.2, 981891.24),
 ('Vietnam', 15.96, 5.93, 0.97, 915183.7),
 ('Kenya', 26.4, 6.89, 1.93, 886358.31),
 ('Afghanistan', 38.57, 13.89, 2.32, 755492.73),
 ('Algeria', 23.67, 4.31, 1.84, 727575.85),
 ('South Africa', 20.75, 9.91, 1.33, 713884.99),
 ('Yemen', 29.98, 6.28, 2.47, 660411.73)]

From the query result, we find that India will add the most to its population, by over 15M people. China and Nigeria are next highest with about 6M and 4M respectively. Others in the top ten countries add between 1.6M-2.9M people.

The birth rates among this list of countries are also higher than death rates and seem to support the fact that population of such countries will have a natural increase.

Finally, let's find an answer to which countries might have death rates higher  than birth rates.

In [55]:
%%sql
SELECT * FROM facts WHERE death_rate > birth_rate  LIMIT 25

Done.

[(10, 'au', 'Austria', 83871, 82445, 1426, 8665550, 0.55, 9.41, 9.42, 5.56),
 (16, 'bo', 'Belarus', 207600, 202900, 4700, 9589689, 0.2, 10.7, 13.36, 0.7),
 (22, 'bk', 'Bosnia and Herzegovina', 51197, 51187, 10, 3867055, 0.13, 8.87, 9.75, 0.38),
 (26, 'bu', 'Bulgaria', 110879, 108489, 2390, 7186893, 0.58, 8.92, 14.44, 0.29),
 (44, 'hr', 'Croatia', 56594, 55974, 620, 4464844, 0.13, 9.45, 12.18, 1.39),
 (47, 'ez', 'Czech Republic', 78867, 77247, 1620, 10644842, 0.16, 9.63, 10.34, 2.33),
 (57, 'en', 'Estonia', 45228, 42388, 2840, 1265420, 0.55, 10.51, 12.4, 3.6),
 (65, 'gm', 'Germany', 357022, 348672, 8350, 80854408, 0.17, 8.47, 11.42, 1.24),
 (67, 'gr', 'Greece', 131957, 130647, 1310, 10775643, 0.01, 8.66, 11.09, 2.32),
 (75, 'hu', 'Hungary', 93028, 89608, 3420, 9897541, 0.22, 9.16, 12.73, 1.33),
 (83, 'it', 'Italy', 301340, 294140, 7200, 61855120, 0.27, 8.74, 10.19, 4.1),
 (85, 'ja', 'Japan', 377915, 364485, 13430, 126919659, 0.16, 7.93, 9.51, 0.0),
 (96, 'lg', 'Latvia', 64589, 62249, 2340, 1986705, 1.06, 10.0, 14.31, 6.26),
 (102, 'lh', 'Lithuania', 65300, 62680, 2620, 2884433, 1.04, 10.1, 14.27, 6.27),
 (116, 'md', 'Moldova', 33851, 32891, 960, 3546847, 1.03, 12.0, 12.59, 9.67),
 (117, 'mn', 'Monaco', 2, 2, 0, 30535, 0.12, 6.65, 9.24, 3.83),
 (139, 'pl', 'Poland', 312685, 304255, 8430, 38562189, 0.09, 9.74, 10.19, 0.46),
 (140, 'po', 'Portugal', 92090, 91470, 620, 10825309, 0.09, 9.27, 11.02, 2.67),
 (142, 'ro', 'Romania', 238391, 229891, 8500, 21666350, 0.3, 9.14, 11.9, 0.24),
 (143, 'rs', 'Russia', 17098242, 16377742, 720500, 142423773, 0.04, 11.6, 13.69, 1.69),
 (153, 'ri', 'Serbia', 77474, 77474, 0, 7176794, 0.46, 9.08, 13.66, 0.0),
 (158, 'si', 'Slovenia', 20273, 20151, 122, 1983412, 0.26, 8.42, 11.37, 0.37),
 (183, 'up', 'Ukraine', 603550, 579330, 24220, 44429471, 0.6, 10.72, 14.46, 2.25),
 (214, 'sb', 'Saint Pierre and Miquelon', 242, 242, 0, 5657, 1.08, 7.42, 9.72, 8.49)]

The list of countries, most of which are European counries with higher death rate than birth rate also seem to have lower *population_growth* compared to the previous query where **European Union**  as a whole ranks much lower in population growth.